MikroElektronika/core_packages/ARM/gcc_clang/def/holtek/HT32F12366-48LQFP/mcu.h
/***************************************************************************//**
 * @file    ht32f1xxxx_01.h
 * @brief   CMSIS Cortex-M3 Device Peripheral Access Layer Header File
 * @version $Rev:: 3212         $
 * @date    $Date:: 2025-03-20 #$
 *
 * @note
 * Copyright (C) Holtek Semiconductor Inc. All rights reserved.
 *
 * @par
 * Holtek supplies this software for Cortex-M processor-based
 * microcontrollers.  This file can be freely distributed within
 * development tools that are supporting such ARM-based processors.
 *
 * @par
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * ARM SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL, OR
 * CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 ******************************************************************************/

// Supported Device
// ========================================
//   HT32F1653, HT32F1654
//   HT32F1655, HT32F1656
//   HT32F12345
//   HT32F12365, HT32F12366
//   HT32F22366
//   HT32F12364

/** @addtogroup CMSIS
  * @{
  */

/** @addtogroup HT32F1xxxx HT32F1xxxx
  * @{
  */


#ifndef __HT32F1XXXX_01_H__
#define __HT32F1XXXX_01_H__

#ifdef __cplusplus
 extern "C" {
#endif

#if !defined(USE_HT32F1653_54) && \
    !defined(USE_HT32F1655_56) && \
    !defined(USE_HT32F12345) && \
    !defined(USE_HT32F12365_66) && \
    !defined(USE_HT32F12364)

  #define USE_HT32F1653_54
  //#define USE_HT32F1655_56
  //#define USE_HT32F12345
  //#define USE_HT32F12365_66

#endif

#if !defined(USE_NOCHIP) && \
    !defined(USE_HT32F1653_54) && \
    !defined(USE_HT32F1655_56) && \
    !defined(USE_HT32F12345) && \
    !defined(USE_HT32F12365_66) && \
    !defined(USE_HT32F12364)

  #error Please add "USE_HT32Fxxxxx_xx" define into C Preprocessor Symbols of the Project configuration.

#endif

/** @addtogroup Library_configuration_section
  * @{
  */
/**
 * @brief Value of the High Speed Internal oscillator in Hz
  */
#define HSI_VALUE         8000000UL   /*!< Value of the High Speed Internal oscillator in Hz                */

/**
 * @brief Value of the Low Speed Internal oscillator in Hz
  */
#define LSI_VALUE         32000UL     /*!< Value of the Low Speed Internal oscillator in Hz                 */

/**
 * @brief Value of the Low Speed External oscillator in Hz
  */
#define LSE_VALUE         32768UL     /*!< Value of the Low Speed External oscillator in Hz                 */

/**
 * @brief Adjust the High Speed External oscillator (HSE) Startup Timeout value
   */
#define HSE_READY_TIME    ((uint16_t)0xFFFF)    /*!< Time out for HSE start up                              */
/**
  * @}
  */

/** @addtogroup Configuration_section_for_CMSIS
  * @{
  */
#define __MPU_PRESENT             0    /*!< MPU present or not                                              */
#define __NVIC_PRIO_BITS          4    /*!< Number of Bits used for Priority Levels                         */
#define __Vendor_SysTickConfig    0    /*!< Set to 1 if different SysTick Config is used                    */

/**
  * @}
  */


/** @addtogroup Configuration_for_Interrupt_Number
  * @{
  */
typedef enum IRQn
{
/****** Cortex-M3 Processor Exceptions Numbers ******************************                               */
  NonMaskableInt_IRQn     = -14,    /*!< 2 Non Maskable Interrupt                                           */
  HardFault_IRQn          = -13,    /*!< 3 Cortex-M3 Hard Fault Interrupt                                   */
  MemoryManagement_IRQn   = -12,    /*!< 4 Cortex-M3 Memory Management Int                                  */
  BusFault_IRQn           = -11,    /*!< 5 Cortex-M3 Bus Fault Interrupt                                    */
  UsageFault_IRQn         = -10,    /*!< 6 Cortex-M3 Usage Fault Interrupt                                  */
  SVCall_IRQn             = -5,     /*!< 11 Cortex-M3 SV Call Interrupt                                     */
  DebugMonitor_IRQn       = -4,     /*!< 12 Cortex-M3 Debug Monitor Interrupt                               */
  PendSV_IRQn             = -2,     /*!< 14 Cortex-M3 Pend SV Interrupt                                     */
  SysTick_IRQn            = -1,     /*!< 15 Cortex-M3 System Tick Interrupt                                 */

/******  HT32 Specific Interrupt Numbers ************************************                               */
  CKRDY_IRQn              = 0,      /*!< Clock ready interrupt                                              */
  LVD_IRQn                = 1,      /*!< Low voltage detection interrupt                                    */
  BOD_IRQn                = 2,      /*!< Brown-Out detection interrupt                                      */
  #if defined(USE_HT32F1653_54) || defined(USE_HT32F1655_56)
  WDT_IRQn                = 3,      /*!< WDT global interrupt                                               */
  #endif
  RTC_IRQn                = 4,      /*!< RTC Wake-up Interrupt                                              */
  FLASH_IRQn              = 5,      /*!< FLASH global Interrupt                                             */
  EVWUP_IRQn              = 6,      /*!< Event Wake-up Interrupt                                            */
  LPWUP_IRQn              = 7,      /*!< WAKEUP pin Interrupt                                               */
  EXTI0_IRQn              = 8,      /*!< EXTI0 Line detection Interrupt                                     */
  EXTI1_IRQn              = 9,      /*!< EXTI1 Line detection Interrupt                                     */
  EXTI2_IRQn              = 10,     /*!< EXTI2 Line detection Interrupt                                     */
  EXTI3_IRQn              = 11,     /*!< EXTI3 Line detection Interrupt                                     */
  EXTI4_IRQn              = 12,     /*!< EXTI4 Line detection Interrupt                                     */
  EXTI5_IRQn              = 13,     /*!< EXTI5 Line detection Interrupt                                     */
  EXTI6_IRQn              = 14,     /*!< EXTI6 Line detection Interrupt                                     */
  EXTI7_IRQn              = 15,     /*!< EXTI7 Line detection Interrupt                                     */
  EXTI8_IRQn              = 16,     /*!< EXTI8 Line detection Interrupt                                     */
  EXTI9_IRQn              = 17,     /*!< EXTI9 Line detection Interrupt                                     */
  EXTI10_IRQn             = 18,     /*!< EXTI10 Line detection Interrupt                                    */
  EXTI11_IRQn             = 19,     /*!< EXTI11 Line detection Interrupt                                    */
  EXTI12_IRQn             = 20,     /*!< EXTI12 Line detection Interrupt                                    */
  EXTI13_IRQn             = 21,     /*!< EXTI13 Line detection Interrupt                                    */
  EXTI14_IRQn             = 22,     /*!< EXTI14 Line detection Interrupt                                    */
  EXTI15_IRQn             = 23,     /*!< EXTI15 Line detection Interrupt                                    */
  #if !defined(USE_HT32F12364)
  COMP_IRQn               = 24,     /*!< Comparator global Interrupt                                        */
  #endif
  ADC0_IRQn               = 25,     /*!< ADC Interrupt                                                      */
  #if !defined(USE_HT32F12364)
  MCTM0_BRK_IRQn          = 27,     /*!< MCTM0 BRK interrupt                                                */
  MCTM0_UP_IRQn           = 28,     /*!< MCTM0 UP interrupt                                                 */
  MCTM0_TR_IRQn           = 29,     /*!< MCTM0 TR interrupt                                                 */
  MCTM0_CC_IRQn           = 30,     /*!< MCTM0 CC interrupt                                                 */
  MCTM1_BRK_IRQn          = 31,     /*!< MCTM1 BRK interrupt                                                */
  MCTM1_UP_IRQn           = 32,     /*!< MCTM1 UP interrupt                                                 */
  MCTM1_TR_IRQn           = 33,     /*!< MCTM1 TR interrupt                                                 */
  MCTM1_CC_IRQn           = 34,     /*!< MCTM1 CC interrupt                                                 */
  #endif
  GPTM0_IRQn              = 35,     /*!< General-Purpose Timer0 Interrupt                                   */
  #if !defined(USE_HT32F12364)
  GPTM1_IRQn              = 36,     /*!< General-Purpose Timer1 Interrupt                                   */
  #endif
  #if defined(USE_HT32F12364)
  SCTM0_IRQn              = 37,     /*!< Single-Channel Timer0 Interrupt                                    */
  SCTM1_IRQn              = 38,     /*!< Single-Channel Timer1 Interrupt                                    */
  PWM0_IRQn               = 39,     /*!< Pulse Width Modulator Timer0 Interrupt                             */
  #endif
  BFTM0_IRQn              = 41,     /*!< Basic Function Timer0 interrupt                                    */
  BFTM1_IRQn              = 42,     /*!< Basic Function Timer1 interrupt                                    */
  I2C0_IRQn               = 43,     /*!< I2C0 global Interrupt                                              */
  I2C1_IRQn               = 44,     /*!< I2C1 global Interrupt                                              */
  SPI0_IRQn               = 45,     /*!< SPI0 global Interrupt                                              */
  SPI1_IRQn               = 46,     /*!< SPI1 global Interrupt                                              */
  USART0_IRQn             = 47,     /*!< USART0 global Interrupt                                            */
  #if !defined(USE_HT32F12364)
  USART1_IRQn             = 48,     /*!< USART1 global Interrupt                                            */
  #endif
  UART0_IRQn              = 49,     /*!< UART0 global Interrupt                                             */
  UART1_IRQn              = 50,     /*!< UART1 global Interrupt                                             */
  #if !defined(USE_HT32F12345)
  SCI_IRQn                = 51,     /*!< Smart Card interface interrupt                                     */
  #endif
  #if !defined(USE_HT32F12364)
  I2S_IRQn                = 52,     /*!< I2S global Interrupt                                               */
  #endif
  USB_IRQn                = 53,     /*!< USB interrupt                                                      */
  #if defined(USE_HT32F12365_66) || defined(USE_HT32F12345)
  SDIO_IRQn               = 54,     /*!< SDIO interrupt                                                     */
  #endif
  PDMACH0_IRQn            = 55,     /*!< PDMA channel 0 global interrupt                                    */
  PDMACH1_IRQn            = 56,     /*!< PDMA channel 1 global interrupt                                    */
  PDMACH2_IRQn            = 57,     /*!< PDMA channel 2 global interrupt                                    */
  PDMACH3_IRQn            = 58,     /*!< PDMA channel 3 global interrupt                                    */
  PDMACH4_IRQn            = 59,     /*!< PDMA channel 4 global interrupt                                    */
  PDMACH5_IRQn            = 60,     /*!< PDMA channel 5 global interrupt                                    */
  #if !defined(USE_HT32F12364)
  PDMACH6_IRQn            = 61,     /*!< PDMA channel 6 global interrupt                                    */
  PDMACH7_IRQn            = 62,     /*!< PDMA channel 7 global interrupt                                    */
  #endif
  #if defined(USE_HT32F12365_66) || defined(USE_HT32F12345)
  PDMACH8_IRQn            = 63,     /*!< PDMA channel 8 global interrupt                                    */
  PDMACH9_IRQn            = 64,     /*!< PDMA channel 9 global interrupt                                    */
  PDMACH10_IRQn           = 65,     /*!< PDMA channel 10 global interrupt                                   */
  PDMACH11_IRQn           = 66,     /*!< PDMA channel 11 global interrupt                                   */
  #endif
  #if defined(USE_HT32F12365_66)
  CSIF_IRQn               = 67,     /*!< CMOS sensor interface interrupt                                    */
  #endif
  #if !defined(USE_HT32F12364)
  EBI_IRQn                = 68,     /*!< External bus interface interrupt                                   */
  #endif
  #if defined(USE_HT32F12365_66) || defined(USE_HT32F12364)
  AES_IRQn                = 69,     /*!< AES interrupt                                                      */
  #endif
} IRQn_Type;

